"""
Function：rnn 训练样本
Author：lzb
Date：2021.02.19

说明：
1、先简单构建1首诗的训练样本：
床前明月光
疑是地上霜
举头望明月
低头思故乡
2、测试样本，也用这首诗
"""

from sample.fully_connected_sample import FullConnectedSample


class HanziEncoder:
    """
    简单测试，只用李白这首诗做 one-hot 编码
    """

    # 这首诗中有几个重复的字符：明、月、头，将这几个重复字符换成：唐、李、白
    dict = {
        "床": [1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
        "前": [0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
        "明": [0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
        "月": [0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
        "光": [0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
        "疑": [0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
        "是": [0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
        "地": [0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
        "上": [0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
        "霜": [0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
        "举": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
        "头": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0],
        "望": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0],
        "唐": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0],
        "李": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0],
        "低": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0],
        "白": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0],
        "思": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0],
        "故": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0],
        "乡": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0],
        "END": [1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1]
    }


class RNNSanmple(FullConnectedSample):
    """
    简单测试，只用李白这首诗做 one-hot 编码，构建 rnn 训练样本
    """

    poem = ["床", "前", "明", "月", "光",
            "疑", "是", "地", "上", "霜",
            "举", "头", "望", "明", "月",
            "低", "头", "思", "故", "乡",
            "END"
            ]

    poem_encoder = HanziEncoder()

    ''''''

    def create_sample(self):
        """
        创建样本
        :return: NULL
        """

        self._create_sx_list()
        self._create_sy_list()

    ''''''

    def _create_sx_list(self):
        """
        创建样本-输入
        :return: NULL
        """
        self._sx_list = list()

        count = len(self.poem)

        for i in range(0, count - 1):
            sx = self.poem_encoder.dict[self.poem[i]]
            self._sx_list.append(sx)

    ''''''

    def _create_sy_list(self):
        """
        创建样本-输出
        :return: NULL
        """
        self._sy_list = list()

        count = len(self.poem)

        for i in range(1, count):
            sy = self.poem_encoder.dict[self.poem[i]]
            self._sx_list.append(sy)

